Revit 2026 API

# CurveLoopGetEnumerator Method

---

Returns an enumerator that iterates through a collection.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual IEnumerator<Curve> GetEnumerator()
```
```vb
Public Overridable Function GetEnumerator As IEnumerator(Of Curve)
```
```cpp
public:
virtual IEnumerator<Curve^>^ GetEnumerator()
```
```fsharp
abstract GetEnumerator : unit -> IEnumerator<Curve>
override GetEnumerator : unit -> IEnumerator<Curve>
```

#### Return Value

IEnumeratorCurveAn IEnumerator object that can be used to iterate through the collection.

#### Implements

IEnumerableTGetEnumerator

#### Reference

CurveLoop Class

Autodesk.Revit.DB Namespace